# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# System
brew "bash"
brew "bat"
brew "bottom"
brew "coreutils"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "gitui"
brew "gopass"
brew "helix"
brew "htop"
brew "mas"
brew "ncurses"
brew "p7zip"
brew "pandoc"
brew "pinentry-mac"
brew "plantuml"
brew "rcm"
brew "rename"
brew "ripgrep"
brew "sponge"
brew "starship"
brew "tmux"
brew "watch"
brew "wget"
brew "zellij"
brew "zoxide"
brew "zsh-syntax-highlighting"

# Ops
brew "k9s"
brew "kubectx", args: ["ignore-dependencies"]
brew "stern"

Helix and addons
brew "helix"
brew "bash-language-server"
brew "marksman"
brew "vscode-langservers-extracted"
brew "yaml-language-server"

# Versioning and packaging
brew "git-crypt"
brew "git-delta"
brew "subversion"

# Dev language stuff
brew "direnv"
brew "jenv"
brew "golang"
brew "ktlint"
brew "maven"
brew "nvm"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "shellcheck"
cask "zulu@21"

# DevOps tooling
brew "cloud-sql-proxy"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "gitlab-runner"
cask "google-cloud-sdk"
brew "httpie"
brew "jless"
brew "jq"
brew "k9s"
brew "kubectx", args: ["ignore-dependencies"]
brew "libpq"
brew "libyaml"
brew "neovim"
brew "stern"
brew "yq"

# Casks
cask "alacritty"
cask "alfred"
cask "bitwarden"
cask "blender"
cask "browserosaurus"
cask "discord"
cask "element"
cask "emacs"
cask "font-fira-code-nerd-font"
cask "logseq"
cask "obsidian"
cask "signal"
cask "syncthing"
