# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# System
brew "bash"
brew "bat"
brew "bottom"
brew "coreutils"
brew "curl"
brew "dog"
brew "eza"
brew "fd"
brew "fzf"
brew "gitui"
brew "gopass"
brew "helix"
brew "htop"
brew "jless"
brew "mas"
brew "ncurses"
brew "p7zip"
brew "pandoc"
brew "pinentry-mac"
brew "plantuml"
brew "rcm"
brew "ripgrep"
brew "sponge"
brew "starship"
brew "tmux"
brew "watch"
brew "wget"
brew "yq"
brew "zsh-syntax-highlighting"

# Ops
brew "k9s"
brew "kubectx", args: ["ignore-dependencies"]
brew "stern"

# Versioning and packaging
brew "git-crypt"
brew "git-delta"
brew "subversion"

# Dev
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "go"
brew "jq"
brew "libyaml"
brew "maven"
brew "neovim"
brew "node"
brew "poetry"
brew "postgresql@14"
brew "rtx"
brew "shellcheck"

# puppet vagrant
brew "git-flow"
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"

# Casks
cask "alacritty"
cask "alfred"
cask "bitwarden"
cask "browserosaurus"
cask "discord"
cask "element"
cask "emacs"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
cask "obsidian"
cask "signal"
cask "syncthing"
